// 类型的可赋值性

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// 1
// class
// 父类型 ----------------------- 父类型更加宽泛
interface IBrandA {
  name: string;
}
// 子类型 ----------------------- 子类型更加具体
interface IBrandB extends IBrandA {
  established: number;
}
let lA: IBrandA = { name: "" };
let lB: IBrandB = { name: "", established: 0 };
lA = lB; // 可以赋值
lB = lA; // 不能赋值

// ----------------------------------------------------------------
// ----------------------------------------------------------------
// 2
// 联合类型
type TEnum1 = 1 | 2 | 3;
type TEnum2 = 2 | 3;
let lC: TEnum1 = 1;
let lD: TEnum2 = 2;
lC = lD;
lD = lC;

